Plan
```
Terraform will perform the following actions:

  # aws_iam_user.stage_demo will be created
  + resource "aws_iam_user" "stage_demo" {
      + arn           = (known after apply)
      + force_destroy = false
      + id            = (known after apply)
      + name          = "stage-demo-00001"
      + path          = "/sre/"
      + unique_id     = (known after apply)
    }

  # aws_iam_user_policy.stage_demo_user_s3_access_policy will be created
  + resource "aws_iam_user_policy" "stage_demo_user_s3_access_policy" {
      + id     = (known after apply)
      + name   = "stage_demo_user_s3_acccess_policy"
      + policy = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "s3:*",
                        ]
                      + Effect   = "Allow"
                      + Resource = [
                          + "arn:aws:s3:::stage_demo_0000001_bucket",
                        ]
                    },
                ]
            }
        )
      + user   = "stage-demo-00001"
    }

Plan: 2 to add, 0 to change, 0 to destroy.```